In [6]:
import pymysql
conn = pymysql.connect(host='localhost', port=3306, user='root', password='Sf@323895474', db='sys')

In [7]:
cursor = conn.cursor()

In [8]:
cursor.execute('CREATE DATABASE IF NOT EXISTS testdb;')

1

In [9]:
cursor.execute('USE testdb;')

0

In [10]:
person_table = '''CREATE TABLE IF NOT EXISTS person
(person_id MEDIUMINT UNSIGNED, first_name VARCHAR(50), last_name VARCHAR(50), 
age TINYINT UNSIGNED, marital_status TINYINT(1), country VARCHAR(75), PRIMARY KEY(person_id));'''

In [11]:
cursor.execute(person_table)

0

In [12]:
cursor.execute('DESC person;')

6

In [13]:
cursor.fetchall()

(('person_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('age', 'tinyint unsigned', 'YES', '', None, ''),
 ('marital_status', 'tinyint(1)', 'YES', '', None, ''),
 ('country', 'varchar(75)', 'YES', '', None, ''))

In [15]:
cursor.execute('USE school;')

0

In [16]:
students_table = '''CREATE TABLE IF NOT EXISTS students
(student_id MEDIUMINT UNSIGNED, first_name VARCHAR(50), last_name VARCHAR(50), 
address VARCHAR(150), state CHAR(2), date_of_birth DATE, 
phone_number BIGINT, gender ENUM('Male', 'Female'), PRIMARY KEY(student_id));'''
cursor.execute(students_table)

0

In [17]:
cursor.execute('DESC students;')
cursor.fetchall()

(('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('address', 'varchar(150)', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('Male','Female')", 'YES', '', None, ''))

In [18]:
cursor.execute('USE testdb')
cursor.execute('DROP TABLE person')

0

In [19]:
cursor = conn.cursor()

In [20]:
cursor.execute('USE school;')

0

In [21]:
four_rows = '''INSERT INTO students VALUES (1, 'Chana', 'Lewy', 'Yam Suf 16', 'IL', '2020-10-21', 0583298764, 'Female'),
(2, 'Sara', 'Cohen', 'Sorotzkin 51', 'IL', '2020-02-04', 0583292264, 'Female'),
(3, 'Meir', 'Baum', 'Hatavor 3', 'IL', '2021-04-14', 0527198764, 'Male'),
(4, 'Chaim', 'Green', 'Kakal 6', 'IL', '2020-12-11', 0545498764, 'Male');'''

In [22]:
cursor.execute(four_rows)

4

In [23]:
update_third_student = "UPDATE students SET address = 'Haerez 4', state = 'FR' WHERE student_id = 3"

In [24]:
cursor.execute(update_third_student)

1

In [25]:
cursor.execute('DELETE FROM students WHERE gender = "Male"')

2

In [26]:
# DROP / ADD
cursor.execute("ALTER TABLE students ADD email_address CHAR(30)")

0

In [27]:
cursor.execute("ALTER TABLE students MODIFY email_address VARCHAR(30)")

2

In [28]:
cursor.execute("ALTER TABLE students MODIFY email_address VARCHAR(30) FIRST")

0

In [29]:
cursor.execute("ALTER TABLE students MODIFY date_of_birth DATE AFTER last_name")

0

In [30]:
cursor.execute('DESC students;')
cursor.fetchall()

(('email_address', 'varchar(30)', 'YES', '', None, ''),
 ('student_id', 'mediumint unsigned', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'YES', '', None, ''),
 ('last_name', 'varchar(50)', 'YES', '', None, ''),
 ('date_of_birth', 'date', 'YES', '', None, ''),
 ('address', 'varchar(150)', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', '', None, ''),
 ('phone_number', 'bigint', 'YES', '', None, ''),
 ('gender', "enum('Male','Female')", 'YES', '', None, ''))

In [31]:
cursor.execute("INSERT INTO students VALUES(%s, %s ,%s ,%s , %s, %s, %s, %s, %s);",('s0583295331@gmail.com', 9, 'Shoshi', 'Finkel', '2001-09-07', 'Shirizly 3', 'IL', '0583295331', 'female'))

1

In [32]:
cursor.execute("SELECT * FROM students;")
cursor.fetchall()

((None,
  1,
  'Chana',
  'Lewy',
  datetime.date(2020, 10, 21),
  'Yam Suf 16',
  'IL',
  583298764,
  'Female'),
 (None,
  2,
  'Sara',
  'Cohen',
  datetime.date(2020, 2, 4),
  'Sorotzkin 51',
  'IL',
  583292264,
  'Female'),
 ('s0583295331@gmail.com',
  9,
  'Shoshi',
  'Finkel',
  datetime.date(2001, 9, 7),
  'Shirizly 3',
  'IL',
  583295331,
  'Female'))

In [33]:
cursor.execute('''INSERT INTO students VALUES (%(email_address)s, %(student_id)s, %(first_name)s, %(last_name)s,
%(date_of_birth)s, %(address)s, %(state)s, %(phone number)s, %(gender)s);''', {'email_address': 'ad23@gmail.com', 'student_id': 90, 'first_name': 'Smith', 'last_name': 'Smith', 'date_of_birth': '2010-01-12',
'address': 'Blau St.','state': "IL",'phone number': "0454343234",'gender': "female"})

1

In [34]:
# !pip install SQLAlchemy
from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw='Sf@323895474',
                               db='school'))

In [35]:
import pandas as pd
students_df = pd.read_csv('student_data.csv')

In [36]:
cursor.execute("ALTER TABLE students DROP email_address")

0

In [ ]:
students_df.to_sql('students', con = engine, if_exists = 'append', chunksize = 1000, index=False)

In [38]:
grades_table = '''CREATE TABLE IF NOT EXISTS grades 
(grade_id MEDIUMINT UNSIGNED AUTO_INCREMENT, student_id MEDIUMINT UNSIGNED, 
course_id TINYINT UNSIGNED, grade TINYINT UNSIGNED, PRIMARY KEY(grade_id));'''
cursor.execute(grades_table)

0

In [39]:
cursor.execute('DESC grades;')
cursor.fetchall()

(('grade_id', 'mediumint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('student_id', 'mediumint unsigned', 'YES', '', None, ''),
 ('course_id', 'tinyint unsigned', 'YES', '', None, ''),
 ('grade', 'tinyint unsigned', 'YES', '', None, ''))

In [40]:
courses_table = '''CREATE TABLE IF NOT EXISTS courses (
course_id INT UNSIGNED AUTO_INCREMENT, 
coure_name VARCHAR(100), 
instructor VARCHAR(100),
PRIMARY KEY(course_id)
)'''
cursor.execute(courses_table)

0

In [41]:
cursor.execute("ALTER TABLE grades MODIFY course_id INT UNSIGNED;")

0

In [42]:
cursor.execute('''ALTER TABLE grades 
ADD FOREIGN KEY (student_id) REFERENCES students (student_id),
ADD FOREIGN KEY (course_id) REFERENCES courses (course_id)''')

0

In [43]:
cursor.execute("ALTER TABLE students MODIFY last_name VARCHAR(50) NOT NULL;")

0

In [44]:
cursor.execute("ALTER TABLE students ADD CONSTRAINT uk_student_id UNIQUE (student_id);")

0

In [ ]:
cursor.execute("ALTER TABLE students ADD CONSTRAINT CHK_student_dob CHECK (date_of_birth <= '2017-01-01');")

In [46]:
set_default_grade = "ALTER TABLE grades ALTER grade SET DEFAULT 100;"
cursor.execute(set_default_grade)

0

In [47]:
# Lesson 17:
# For 1NF: Create a Phone Number table with the columns: staff_id, phone_number. for each phone number - seperate line in the table.
# For 2NF, 3NF: Create a Room table with the columns: room_id, room_num, ext_num. add the room_id column to staff table.

In [48]:
# Lesson 18:
# Denormalization: add course_name and instructor to the grades table.

In [49]:
cursor.execute("CREATE INDEX idx_last_name ON students(last_name);")

0

In [51]:
cursor.execute("SHOW INDEXES FROM students;")

3

In [52]:
cursor.fetchall()

(('students',
  0,
  'PRIMARY',
  1,
  'student_id',
  'A',
  4,
  None,
  None,
  '',
  'BTREE',
  '',
  '',
  'YES',
  None),
 ('students',
  0,
  'uk_student_id',
  1,
  'student_id',
  'A',
  4,
  None,
  None,
  '',
  'BTREE',
  '',
  '',
  'YES',
  None),
 ('students',
  1,
  'idx_last_name',
  1,
  'last_name',
  'A',
  4,
  None,
  None,
  '',
  'BTREE',
  '',
  '',
  'YES',
  None))

In [ ]:
conn.close()